STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Server_Coord/STM32_WPAN/App/app_zigbee.c
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/zcl.payload.h"
#include "zcl/general/zcl.onoff.h"
#include "zcl/general/zcl.time.h"
#include "zcl/general/zcl.ota.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY          500U
#define SW1_ENDPOINT                           17
#define SW1_GROUP_ADDR                         0x0001
#define CHANNEL                                19
#define HW_TS_SERVER_1S_NB_TICKS               (1*1000*1000/CFG_TS_TICK_VAL)
#define OTA_CLIENT_UPGRADE_DELAY               5       /* 5s */
   
/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_ConfigGroupAddr(void);
static void APP_ZIGBEE_App_Init(void);
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_SW2_Process(void);

/* OnOff */
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_Off_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_On_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_Toggle_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAddrInfoT *srcInfo, void *arg);

/* Time */
static uint32_t APP_ZIGBEE_Time_Server_GetTime_cb(struct ZbZclClusterT *clusterPtr, void *arg);
static void APP_ZIGBEE_Time_Server_SetTime_cb(struct ZbZclClusterT *clusterPtr, uint32_t time_val, void *arg);

/* OTA */
static void APP_ZIGBEE_OTA_Server_Init(void);
static bool APP_ZIGBEE_OTA_Server_QueryNextImage_cb(struct ZbZclOtaImageDefinition *query_image, uint8_t field_control, 
                                             uint16_t hadware_version, uint32_t *image_size, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Server_ImageBlock_cb(struct ZbZclOtaImageDefinition *image,  struct ZbZclOtaImageData *image_data, 
                                                        uint8_t field_control, uint64_t request_node_address, 
                                                        struct ZbZclOtaImageWaitForData *image_wait, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Server_UpgradeEnd_cb(struct ZbZclOtaImageDefinition *image_definition, enum ZclStatusCodeT *status, 
                                                               struct ZbZclOtaEndResponseTimes *end_response_times, void *arg);

static void APP_ZIGBEE_OTA_Server_ImageNotify(void);
static int APP_ZIGBEE_OTA_Server_FindSuitableImage(struct ZbZclOtaImageDefinition *query);
static uint8_t APP_ZIGBEE_OTA_Server_HeaderMake(const struct ZbZclOtaHeader* ota_header, uint8_t* payload);
static uint32_t APP_ZIGBEE_GetBinSize(void);
static uint32_t GetFirstSecureSector(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

/* OnOff server custom callbacks */
static struct ZbZclOnOffServerCallbacksT ZbZclOnOffServerCallbacks = {
  .off = APP_ZIGBEE_OnOff_Server_Off_cb,
  .on = APP_ZIGBEE_OnOff_Server_On_cb,
  .toggle = APP_ZIGBEE_OnOff_Server_Toggle_cb,
};

/* Time server custom callbacks */
static struct ZbZclTimeServerCallbacks ZbZclTimeServerCallbacks = {
  .get_time = APP_ZIGBEE_Time_Server_GetTime_cb,
  .set_time = APP_ZIGBEE_Time_Server_SetTime_cb,
};

static struct APP_ZIGBEE_OtaServerInfo OTA_server_info;

static struct ZbZclOtaHeader image_header_list[] = {
  /* M0 OTA header */
  {
    .file_identifier = ZCL_OTA_HEADER_FILE_IDENTIFIER,
    .header_version = ZCL_OTA_HEADER_FILE_VERSION,
    .header_length = ZCL_OTA_HEADER_LENGTH_MIN, /* minimum header size (no optional fields) */
    .header_field_control = 0, /* no optional fields in the header */
    .manufacturer_code = ST_ZIGBEE_MANUFACTURER_CODE,
    .image_type = IMAGE_TYPE_FW_COPRO_WIRELESS,
    .file_version = FILE_VERSION_FW_COPRO_WIRELESS,
    .stack_version = ZCL_OTA_STACK_VERSION_PRO,
    .header_string = "M0 binary",
    .total_image_size = 0,
  },
  
  /* M4 OTA header */
  {
    .file_identifier = ZCL_OTA_HEADER_FILE_IDENTIFIER,
    .header_version = ZCL_OTA_HEADER_FILE_VERSION,
    .header_length = ZCL_OTA_HEADER_LENGTH_MIN, /* minimum header size (no optional fields) */
    .header_field_control = 0, /* no optional fields in the header */
    .manufacturer_code = ST_ZIGBEE_MANUFACTURER_CODE,
    .image_type = IMAGE_TYPE_FW_APP,
    .file_version = FILE_VERSION_FW_APP,
    .stack_version = ZCL_OTA_STACK_VERSION_PRO,
    .header_string = "M4 binary",
    .total_image_size = 0,
  },
};

