STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Server_Coord/STM32_WPAN/App/app_zigbee.c
/* OTA server custom callbacks */
static struct ZbZclOtaServerConfig server_config = {
  .profile_id = ZCL_PROFILE_HOME_AUTOMATION,
  .endpoint = SW1_ENDPOINT,
  .image_eval = APP_ZIGBEE_OTA_Server_QueryNextImage_cb,
  .image_read = APP_ZIGBEE_OTA_Server_ImageBlock_cb,
  .image_upgrade_end_req = APP_ZIGBEE_OTA_Server_UpgradeEnd_cb,
  .arg = &OTA_server_info,
};

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;

  struct ZbZclClusterT *ota_server;
  struct ZbZclClusterT *time_server;
  struct ZbZclClusterT *onoff_server;
};
static struct zigbee_app_info zigbee_app_info;

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  OTA server Query Next Image callback
 * @param  query_image: Sender image query definition pointer
 * @param  field_control: Additional value field control
 * @param  hadware_version: Optional hardware version parameter
 * @param  image_size: Pointer to image size value
 * @param  arg: Passed argument
 * @retval bool
 */
static bool APP_ZIGBEE_OTA_Server_QueryNextImage_cb(struct ZbZclOtaImageDefinition *query_image, uint8_t field_control, 
                                             uint16_t hadware_version, uint32_t *image_size, void *arg){
  struct APP_ZIGBEE_OtaServerInfo* server_info = (struct APP_ZIGBEE_OtaServerInfo*) arg;
  int i = 0;
                                               
  APP_DBG("[OTA] Query Next Image request received.");
  APP_DBG("[OTA] Sender device manufacturer code: 0x%04x.", query_image->manufacturer_code);
  APP_DBG("[OTA] Sender device current file version: 0x%08x.", query_image->file_version);
  if(field_control == ZCL_OTA_QUERY_FIELD_CONTROL_HW_VERSION){
    /* additional hardware info is provided by the sender */
    APP_DBG("[OTA] Sender device current hardware version: 0x%04x.", hadware_version);
  }
  APP_DBG("[OTA] Sender device is requesting an upgrade for 0x%04x image type.", query_image->image_type);
  
  i = APP_ZIGBEE_OTA_Server_FindSuitableImage(query_image);
  if(i<0){
    APP_DBG("[OTA] A such image is not available.\n");
    return false;
  }
  
  APP_DBG("[OTA] A such image is available.\n");
  *image_size = image_header_list[i].total_image_size;
  
  /* Keep header data to use it for transmitting ZCL OTA header in block transfer callback */
  server_info->requested_image_header = image_header_list[i];
  
  return true;
}

/**
 * @brief  OTA server Image Block callback
 * @param  image: Sender image query definition pointer
 * @param  image_data: Block query parameters pointer
 * @param  field_control: Additional value field control
 * @param  request_node_address: Sender OTA client extended address
 * @param  image_wait: Waiting parameters pointer
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Server_ImageBlock_cb(struct ZbZclOtaImageDefinition *image,  struct ZbZclOtaImageData *image_data, 
                                                        uint8_t field_control, uint64_t request_node_address, 
                                                        struct ZbZclOtaImageWaitForData *image_wait, void *arg){
  
  struct APP_ZIGBEE_OtaServerInfo* server_info = (struct APP_ZIGBEE_OtaServerInfo*) arg;                                                                                                      
  uint8_t size = image_data->data_size;
  uint32_t flash_copy_size = 0;
  uint8_t header_buffer[ZCL_OTA_HEADER_LENGTH_MAX];
  unsigned int header_index, tag_index;
  uint8_t upgrade_image_tag[ZCL_OTA_IMAGE_BLOCK_SUB_ELEMENT_HEADER];   
  
  memset(image_data->data, 0, sizeof(image_data->data));
  header_index = 0;
  tag_index = 0;
  
  /* Check if we need to update RAM buffer */
  if(image_data->file_offset >= server_info->block_transfer.max_buffer_offset){
    memset(server_info->block_transfer.firmware_buffer, 0, sizeof(server_info->block_transfer.firmware_buffer));
    
    /* Add ZCL OTA header info if not already done. Only one time */
    if(!server_info->block_transfer.OTA_FileDataGenerated){
      header_index = APP_ZIGBEE_OTA_Server_HeaderMake(&server_info->requested_image_header, header_buffer);
      if(header_index != server_info->requested_image_header.header_length){
        APP_DBG("Error, OTA header invalid.");
        return ZCL_STATUS_FAILURE;
      }
      memcpy(server_info->block_transfer.firmware_buffer, header_buffer, header_index);
      
      /* Add associated tag to transmit firmware data as OTA sub-element */
      memset(upgrade_image_tag, 0, sizeof(upgrade_image_tag));
    
      /* Tag ID */
      zb_zcl_append_uint16(upgrade_image_tag, sizeof(upgrade_image_tag), &tag_index, ZCL_OTA_SUB_TAG_UPGRADE_IMAGE);
    
      /* Length field */
      zb_zcl_append_uint32(upgrade_image_tag, sizeof(upgrade_image_tag), &tag_index, server_info->ctx.binary_size);
    
      memcpy(server_info->block_transfer.firmware_buffer+header_index, upgrade_image_tag, sizeof(upgrade_image_tag));
      
      server_info->block_transfer.OTA_FileDataGenerated = true;   
      server_info->block_transfer.flash_addr = server_info->ctx.base_address;  
    }
    
    /* Add firmware data to RAM buffer */
    flash_copy_size = server_info->requested_image_header.total_image_size - image_data->file_offset;
    if(flash_copy_size>RAM_FIRMWARE_BUFFER_SIZE){
      flash_copy_size = RAM_FIRMWARE_BUFFER_SIZE;
    }
    flash_copy_size -= (header_index+tag_index);
    
    memcpy(server_info->block_transfer.firmware_buffer+header_index+tag_index, 
           (void const*)(server_info->block_transfer.flash_addr), flash_copy_size);
    server_info->block_transfer.flash_addr += flash_copy_size;
    server_info->block_transfer.max_buffer_offset += sizeof(server_info->block_transfer.firmware_buffer);
    
    /* Display Transfer Progress */
    APP_DBG("[OTA] FUOTA Transfer at adress %x",server_info->block_transfer.flash_addr);

  }
  
  /* Write OTA firmware data to destination buffer */
  
  /* If needed adjust the last block for the end of the image */
  if (image_data->file_offset + size > server_info->requested_image_header.total_image_size) {
    size = server_info->requested_image_header.total_image_size - image_data->file_offset;
  }
  
  /* If needed, adjust block size regarding RAM buffer max size */
  if(image_data->file_offset + size > server_info->block_transfer.max_buffer_offset){
    size = server_info->block_transfer.max_buffer_offset - image_data->file_offset;
  }

  /* Beyond the end of the image */
  if (size <= 0) {
    APP_DBG("[OTA] Warning, offset requested (%d bytes) is too big regarding OTA file size (%d bytes)",
            image_data->file_offset, server_info->requested_image_header.total_image_size);
    return ZCL_STATUS_INVALID_VALUE;
  }

  /* Update with bytes actually read */
  image_data->data_size = size;
  
  memcpy(image_data->data, 
         server_info->block_transfer.firmware_buffer+(image_data->file_offset % sizeof(server_info->block_transfer.firmware_buffer)),
         size);
  
