STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Server_Coord/STM32_WPAN/App/app_zigbee.c
  return ZCL_STATUS_SUCCESS;                                             
}

/**
 * @brief  OTA server Upgrade End callback
 * @param  image_definition: Sender image query definition pointer
 * @param  status: ZCL upgrade end status pointer
 * @param  end_response_times: Upgrade end times pointer (current and upgrade time)
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OTA_Server_UpgradeEnd_cb(struct ZbZclOtaImageDefinition *image_definition, enum ZclStatusCodeT *status, 
                                                               struct ZbZclOtaEndResponseTimes *end_response_times, void *arg){
  APP_DBG("**************************************************************\n");
  APP_DBG("[OTA] Upgrade End request received.");
  
  /* Show upgrade end status */
  switch (*status) {
    case ZCL_STATUS_SUCCESS:
      end_response_times->current_time = 0;                        /* relative to now */
      end_response_times->upgrade_time = OTA_CLIENT_UPGRADE_DELAY; /*  delay from now */
  
      APP_DBG("UpgradeEnd status SUCCESS, responding with:");
      APP_DBG("  current time: %d", end_response_times->current_time);
      APP_DBG("  upgrade time: %d\n", end_response_times->upgrade_time);
      break;

    case ZCL_STATUS_INVALID_IMAGE:
      APP_DBG("UpgradeEnd status INVALID_IMAGE");
      return ZCL_STATUS_INVALID_IMAGE;

    case ZCL_STATUS_REQUIRE_MORE_IMAGE:
      APP_DBG("UpgradeEnd status REQUIRE_MORE_IMAGE");
      return ZCL_STATUS_REQUIRE_MORE_IMAGE;

    case ZCL_STATUS_ABORT:
      APP_DBG("UpgradeEnd status ABORT");
      return ZCL_STATUS_ABORT;

    default:
      APP_DBG("UpgradeEnd UNKNOWN status 0x%02x", status);
      return ZCL_STATUS_FAILURE;
    }
  
  
  return ZCL_STATUS_SUCCESS;                                             
}

/**
 * @brief  Time server GetTime callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  arg: Passed argument
 * @retval None
 */
static uint32_t APP_ZIGBEE_Time_Server_GetTime_cb(struct ZbZclClusterT *clusterPtr, void *arg){
  uint32_t time = HAL_GetTick();
  return time;
}

/**
 * @brief  Time server SetTime callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  time_val: time value to set
 * @param  arg: Passed argument
 * @retval None
 */
static void APP_ZIGBEE_Time_Server_SetTime_cb(struct ZbZclClusterT *clusterPtr, uint32_t time_val, void *arg){
  
  /* Unused function */
  
  UNUSED(clusterPtr);
  UNUSED(time_val);
  UNUSED(arg);
}

/**
 * @brief  OnOff server Off callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  srcInfo: Sender address info
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_Off_cb(struct ZbZclClusterT *clusterPtr,
    struct ZbZclAddrInfoT *srcInfo, void *arg)
{
    uint8_t endpoint;

    endpoint = ZbZclClusterGetEndpoint(clusterPtr);
    if (endpoint == SW1_ENDPOINT) {
        APP_DBG("LED_RED OFF");
        BSP_LED_Off(LED_RED);
        (void)ZbZclAttrIntegerWrite(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, 0);
    }
    else {
        /* Unknown endpoint */
        return ZCL_STATUS_FAILURE;
    }
    return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  OnOff server On callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  srcInfo: Sender address info
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_On_cb(struct ZbZclClusterT *clusterPtr,
    struct ZbZclAddrInfoT *srcInfo, void *arg)
{
    uint8_t endpoint;

    endpoint = ZbZclClusterGetEndpoint(clusterPtr);
    if (endpoint == SW1_ENDPOINT) {
        APP_DBG("LED_RED ON");
        BSP_LED_On(LED_RED);
        (void)ZbZclAttrIntegerWrite(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, 1);
    }
    else {
        /* Unknown endpoint */
        return ZCL_STATUS_FAILURE;
    }
    return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  OnOff server Toggle callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  srcInfo: Sender address info
 * @param  arg: Passed argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOff_Server_Toggle_cb(struct ZbZclClusterT *clusterPtr,
    struct ZbZclAddrInfoT *srcInfo, void *arg)
{
    uint8_t attrVal;

    if (ZbZclAttrRead(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, NULL,
            &attrVal, sizeof(attrVal), false) != ZCL_STATUS_SUCCESS) {
        return ZCL_STATUS_FAILURE;
    }
    if (attrVal != 0) {
        return APP_ZIGBEE_OnOff_Server_Off_cb(clusterPtr, srcInfo, arg);
    }
    else {
        return APP_ZIGBEE_OnOff_Server_On_cb(clusterPtr, srcInfo, arg);
    }
}

/**
 * @brief  OTA Server Image Notify command
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_OTA_Server_ImageNotify(void){
  enum ZclStatusCodeT status = ZCL_STATUS_SUCCESS;
  struct ZbApsAddrT dst;
  struct ZbZclOtaImageDefinition image_definition;
  uint64_t size;
  int pos = 0; 
  
  /* We have to prevent OTA client devices that a new version is available */
  
  /* Destination configuration */
  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  dst.endpoint = 255; /* Broadcast => any endpoint */
  dst.nwkAddr = 0xffff; /* Broadcast mode */ 
  
  /* Image definition configuration */
  memset(&image_definition, 0, sizeof(image_definition));
  image_definition.manufacturer_code = ST_ZIGBEE_MANUFACTURER_CODE;
  image_definition.image_type = OTA_server_info.ctx.file_type;
  
  pos = APP_ZIGBEE_OTA_Server_FindSuitableImage(&image_definition);
  if(pos<0){
    APP_DBG("[OTA] A such image is not available.\n");
    return;
  }
  
  image_definition.file_version = OTA_server_info.ctx.file_version;
  
  /* Obtain binary size from the binary stored in Flash */
  size = APP_ZIGBEE_GetBinSize();
  if(size == 0){
    return;
  }
  OTA_server_info.ctx.binary_size = size;
  
  /* Update total image size of the OTA file 
     (will be dynamically generated from binary stored in Flash ) */
  image_header_list[pos].total_image_size = size /* binary size */ 
    + image_header_list[pos].header_length /* header size */
    + ZCL_OTA_IMAGE_BLOCK_SUB_ELEMENT_HEADER; /* upgrade tag size */
  
  APP_DBG("[OTA] Binary size: %d bytes.", OTA_server_info.ctx.binary_size);
  APP_DBG("[OTA] OTA binary total size: %d bytes.", image_header_list[pos].total_image_size);
  
  /* Sending an Image Notify request to the client 
   * QueryJitter parameter set to 0 => No flooding prevention */
  APP_DBG("[OTA] Sending Image Notify request to all OTA client devices (broadcast mode).\n");
  status = ZbZclOtaServerImageNotifyReq(zigbee_app_info.ota_server, &dst, 
                                        ZCL_OTA_NOTIFY_TYPE_FILE_VERSION, 0, &image_definition);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("ZbZclOtaServerImageNotifyReq failed.\n");
    assert(0);
  }
}

/**
 * @brief  OTA Server find image helper
 * @param  query: image definition requested
 * @retval image index value
 */
static int APP_ZIGBEE_OTA_Server_FindSuitableImage(struct ZbZclOtaImageDefinition *query){
    struct ZbZclOtaHeader *image;

