STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OTA_Server_Coord/STM32_WPAN/App/app_zigbee.c
    for (uint32_t i = 0; i < (sizeof(image_header_list)/sizeof(*image_header_list)); i++) {
        image = &image_header_list[i];

        /* allow either wildcard or exact match */
        if ((query->manufacturer_code != ZB_MFG_CODE_WILDCARD)
            && (image->manufacturer_code != query->manufacturer_code)) {
            continue;
        }

        /* allow either wildcard or exact match */
        if ((query->image_type != ZCL_OTA_IMAGE_TYPE_WILDCARD)
            && (image->image_type != query->image_type)) {
            continue;
        }

        /* allow both upgrade and downgrade but not exactly same version */
        if (image->file_version == query->file_version) {
            continue;
        }

        return i;
    }

    return -1;
}

/**
 * @brief  OTA Server OTA file format header generation helper
 * @param  ota_header: OTA header structure
 * @param  payload: resulting OTA header in binary format
 * @retval Payload index value
 */
static uint8_t APP_ZIGBEE_OTA_Server_HeaderMake(const struct ZbZclOtaHeader* ota_header, uint8_t* payload)
{
    unsigned int index = 0;
    uint8_t length = sizeof(struct ZbZclOtaHeader);
    
    /* Check OTA header file identifier */
    if (ota_header->file_identifier != ZCL_OTA_HEADER_FILE_IDENTIFIER) {
        return 0;
    }

    if (zb_zcl_append_uint32(payload, length, &index, ota_header->file_identifier) < 0) {
        return 0;
    }
 
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->header_version) < 0) {
        return index;
    }
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->header_length) < 0) {
        return index;
    }
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->header_field_control) < 0) {
        return index;
    }
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->manufacturer_code) < 0) {
        return index;
    }
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->image_type) < 0) {
        return index;
    }
    if (zb_zcl_append_uint32(payload, length, &index, ota_header->file_version) < 0) {
        return index;
    }
    if (zb_zcl_append_uint16(payload, length, &index, ota_header->stack_version) < 0) {
        return index;
    }
    if (index + 32 > length) {
        return index;
    }
    (void)memcpy(payload + index, ota_header->header_string, 32);
    index += 32;

    if (zb_zcl_append_uint32(payload, length, &index, ota_header->total_image_size) < 0) {
        return index;
    }

    /* optional fields are based field control */
    if (ota_header->header_field_control & ZCL_OTA_HEADER_FIELD_CONTROL_SECURITY_VERSION) {
        if (zb_zcl_append_uint8(payload, length, &index, ota_header->sec_credential_version) < 0) {
            return index;
        }
    }
    if (ota_header->header_field_control & ZCL_OTA_HEADER_FIELD_CONTROL_DEVICE_SPECIFIC) {
        if (zb_zcl_append_uint64(payload, length, &index, ota_header->file_destination) < 0) {
            return index;
        }
    }
    if (ota_header->header_field_control & ZCL_OTA_HEADER_FIELD_CONTROL_HARDWARE_VERSIONS) {
        if (zb_zcl_append_uint16(payload, length, &index, ota_header->min_hardware_version) < 0) {
            return index;
        }
        if (zb_zcl_append_uint16(payload, length, &index, ota_header->max_hardware_version) < 0) {
            return index;
        }
    }
    return index;
}

/**
 * @brief  Getting embedded FW binary size helper
 * @param  None
 * @retval Size
 */
static uint32_t APP_ZIGBEE_GetBinSize(void)
{
  uint32_t flash_current_offset = 0;
  uint64_t read64 = 0;
  bool binary_parsing_on_going = TRUE;
  bool error_keyword_or_size = FALSE;
  uint32_t first_secure_sector_idx;
  uint32_t maximum_reachable_offset;
  uint32_t fuota_bin_size = 0;

  first_secure_sector_idx = GetFirstSecureSector();

  /* Compute Maximum reachable address */
  maximum_reachable_offset = (first_secure_sector_idx * 0x1000) - 1;
  APP_DBG("maximum_reachable_offset =  0x%x", maximum_reachable_offset);

  while(binary_parsing_on_going == TRUE){
    read64 = *(uint64_t*)(OTA_server_info.ctx.base_address + flash_current_offset);

    /* Test if current word contains magic keyword */
    if((read64 & 0x00000000FFFFFFFF) == OTA_server_info.ctx.magic_keyword)
    {
      binary_parsing_on_going = FALSE;
    }
    else if (((read64 & 0xFFFFFFFF00000000) >> 32) == OTA_server_info.ctx.magic_keyword)
    {
      binary_parsing_on_going = FALSE;
    }

    flash_current_offset += 8;

    /* Test current offset is still below SFSA (Non-Secure Memory Address) */
    if(flash_current_offset > maximum_reachable_offset)
    {
      error_keyword_or_size = TRUE;
      binary_parsing_on_going = FALSE;
    }
  }

  if(error_keyword_or_size == TRUE)
  {
    APP_DBG("Error: FUOTA Keyword not found in FLASH memory, aborting!");
  }
  else
  {
    fuota_bin_size = flash_current_offset;
  }

  return fuota_bin_size;
}

/**
 * @brief  Getting flash first secure sector helper
 * @param  None
 * @retval First flash secure sector 
 */
static uint32_t GetFirstSecureSector(void)
{
  uint32_t first_secure_sector_idx, sfsa_field, sbrv_field, sbrv_field_sector;

  /* Read SFSA */
  sfsa_field = (READ_BIT(FLASH->SFR, FLASH_SFR_SFSA) >> FLASH_SFR_SFSA_Pos);
  APP_DBG("SFSA OB = 0x%x", sfsa_field);
  APP_DBG("SFSA Option Bytes set to sector = 0x%x (0x080%x)", sfsa_field, sfsa_field*4096);

  /* Read SBRV */
  /* Contains the word aligned CPU2 boot reset start address offset within the selected memory area by C2OPT. */
  sbrv_field = (READ_BIT(FLASH->SRRVR, FLASH_SRRVR_SBRV) >> FLASH_SRRVR_SBRV_Pos);
  APP_DBG("SBRV OB = 0x%x", sbrv_field);
  /* Divide sbrv_field by 1024 to be compared to SFSA value */
  sbrv_field_sector = sbrv_field / 1024;
  APP_DBG("SBRV Option Bytes set to sector = 0x%x (0x080%x)", sbrv_field_sector, sbrv_field*4);

  /* If SBRV is below SFSA then set first_secure_sector_idx to SBRV */
  if (sbrv_field_sector < sfsa_field)
  {
    first_secure_sector_idx = sbrv_field_sector;
  }
  else
  {
    first_secure_sector_idx = sfsa_field;
  }

  APP_DBG("first_secure_sector_idx = 0x%x", first_secure_sector_idx);

  return first_secure_sector_idx;
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Task associated with OTA Server ImageNotify command */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_OTA_SERVER_IMAGE_NOTIFY, UTIL_SEQ_RFU, APP_ZIGBEE_OTA_Server_ImageNotify);
  
